In [1]:
import mysql.connector as m

In [2]:
#Connecting to Database Server
#host -- url/ip-address
my_con = m.connect(host = "localhost", user = "root", password = "123456", port = 3306)

In [3]:
my_con

In [4]:
#Cursor---To excecute SQL Queries
my_cur = my_con.cursor()

In [5]:
my_cur

#### Show databases

In [6]:
my_cur.execute("show databases")

In [7]:
#read operation
my_cur.fetchall()

[('information_schema',),
 ('mydb',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

#### Creating a database

In [110]:
#execute --SQL Query
my_cur.execute("create database mydb")

#### Show Databases

In [111]:
#Read query
my_cur.execute("show databases")

In [112]:
my_cur.fetchall()

[('information_schema',),
 ('mydb',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

#### Create a Table

In [8]:
#Connecting to specific Database
my_con = m.connect(host = "localhost",user = "root", password = "123456", port=3306, database = "mydb")

In [9]:
my_cur = my_con.cursor()

In [ ]:
#create a table

In [115]:
my_cur.execute("create table employee_data (emp_id int,emp_name varchar(100),emp_salary float,married_status boolean,emp_blood_group text)")

In [116]:
my_cur.execute("show tables")

In [117]:
my_cur.fetchall()

[('employee_data',)]

#### Insert Data into table

In [118]:
my_cur.execute("insert into employee_data (emp_id,emp_name,emp_salary,married_status,emp_blood_group) values (1,'Abhishek',60000.50,False,'O+')")

#### Read data from table

In [119]:
my_cur.execute("select * from employee_data")

In [120]:
my_cur.fetchall()

[(1, 'Abhishek', 60000.5, 0, 'O+')]

#### Insert multiple rows

In [122]:
val = [(20,"Ajay",40000.0,False,'B+'),(30,"Ramu",30000.0,True,'A+'),
       (40,"Ramesh",10000.0,False,'B-'),(50,"Rahul",25000.0,False,'B+'),
      (60,"Suresh",50000.0,True,'A+'),(60,"Rajesh",60000.0,False,'O+')]

In [123]:
val

[(20, 'Ajay', 40000.0, False, 'B+'),
 (30, 'Ramu', 30000.0, True, 'A+'),
 (40, 'Ramesh', 10000.0, False, 'B-'),
 (50, 'Rahul', 25000.0, False, 'B+'),
 (60, 'Suresh', 50000.0, True, 'A+'),
 (60, 'Rajesh', 60000.0, False, 'O+')]

In [124]:
sql = "insert into employee_data (emp_id, emp_name, emp_salary, married_status, emp_blood_group) values (%s, %s, %s, %s, %s)"

In [125]:
my_cur.executemany(sql,val)

In [11]:
my_cur.execute("select * from employee_data")
my_cur.fetchall()

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (20, 'Ajay', 40000.0, 0, 'B+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (40, 'Ramesh', 10000.0, 0, 'B-'),
 (50, 'Rahul', 25000.0, 0, 'B+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (60, 'Rajesh', 60000.0, 0, 'O+')]

#### Create Table with Constraints

In [127]:
my_cur.execute("create table employee_data_2 (emp_id int,primary key (emp_id),emp_name text not null,emp_salary float,married_status boolean,emp_blood_group text)")

#### Insert Data with Constraints

In [12]:
val = [(20,"Ajay",40000.0,False,'B+'),(30,"Ramu",30000.0,True,'A+'),
       (40,"Ramesh",10000.0,False,'B-'),(50,"Rahul",25000.0,False,'B+'),
      (60,"Suresh",50000.0,True,'A+'),(61,"Rajesh",60000.0,False,'O+')]

In [13]:
val

[(20, 'Ajay', 40000.0, False, 'B+'),
 (30, 'Ramu', 30000.0, True, 'A+'),
 (40, 'Ramesh', 10000.0, False, 'B-'),
 (50, 'Rahul', 25000.0, False, 'B+'),
 (60, 'Suresh', 50000.0, True, 'A+'),
 (61, 'Rajesh', 60000.0, False, 'O+')]

In [14]:
sql="insert into employee_data_2 (emp_id, emp_name, emp_salary, married_status, emp_blood_group) values (%s, %s, %s, %s, %s)"

In [15]:
my_cur.executemany(sql,val)

In [16]:
my_cur.execute("select * from employee_data_2")
my_cur.fetchall()

[(20, 'Ajay', 40000.0, 0, 'B+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (40, 'Ramesh', 10000.0, 0, 'B-'),
 (50, 'Rahul', 25000.0, 0, 'B+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (61, 'Rajesh', 60000.0, 0, 'O+')]

In [21]:
my_cur.execute("select emp_name, emp_blood_group from employee_data_2")

In [22]:
my_cur.fetchall()

[('Ajay', 'B+'),
 ('Ramu', 'A+'),
 ('Ramesh', 'B-'),
 ('Rahul', 'B+'),
 ('Suresh', 'A+'),
 ('Rajesh', 'O+')]

In [23]:
def show_data(table_name, cursor):
    cursor.execute("select * from " + table_name)
    return cursor.fetchall()

In [24]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (20, 'Ajay', 40000.0, 0, 'B+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (40, 'Ramesh', 10000.0, 0, 'B-'),
 (50, 'Rahul', 25000.0, 0, 'B+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (60, 'Rajesh', 60000.0, 0, 'O+')]

#### Where condition

In [25]:
my_cur.execute("select * from employee_data where emp_id=20")

In [26]:
my_cur.fetchall()

[(20, 'Ajay', 40000.0, 0, 'B+')]

In [28]:
my_cur.execute("select emp_id,emp_name from employee_data where emp_salary>30000")
my_cur.fetchall()

[(1, 'Abhishek'), (20, 'Ajay'), (60, 'Suresh'), (60, 'Rajesh')]

In [29]:
my_cur.execute("select emp_id,emp_name from employee_data where emp_salary>30000 and married_status=True")
my_cur.fetchall()

[(60, 'Suresh')]

In [30]:
my_cur.execute("select emp_id,emp_name from employee_data where emp_blood_group='O+' or emp_blood_group='A+'")
my_cur.fetchall()

[(1, 'Abhishek'), (30, 'Ramu'), (60, 'Suresh'), (60, 'Rajesh')]

#### Order by

In [35]:
my_cur.execute("select * from employee_data order by emp_salary desc")

In [36]:
my_cur.fetchall()

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (60, 'Rajesh', 60000.0, 0, 'O+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (20, 'Ajay', 40000.0, 0, 'B+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (50, 'Rahul', 25000.0, 0, 'B+'),
 (40, 'Ramesh', 10000.0, 0, 'B-')]

In [39]:
my_cur.execute("select * from employee_data order by emp_salary desc limit 4")

In [40]:
my_cur.fetchall()

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (60, 'Rajesh', 60000.0, 0, 'O+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (20, 'Ajay', 40000.0, 0, 'B+')]

In [41]:
my_cur.execute("select sum(emp_salary) from employee_data")

In [42]:
my_cur.fetchall()

[(275000.5,)]

In [45]:
my_cur.execute("select sum(emp_salary), avg(emp_salary) from employee_data")

In [46]:
my_cur.fetchall()

[(275000.5, 39285.78571428572)]

In [47]:
my_cur.execute("select count(emp_id) from employee_data")

In [48]:
my_cur.fetchall()

[(7,)]

In [49]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (20, 'Ajay', 40000.0, 0, 'B+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (40, 'Ramesh', 10000.0, 0, 'B-'),
 (50, 'Rahul', 25000.0, 0, 'B+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (60, 'Rajesh', 60000.0, 0, 'O+')]

#### Update Data in Table

In [50]:
my_cur.execute("update employee_data set emp_salary=70000 where emp_id=20")

In [51]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (20, 'Ajay', 70000.0, 0, 'B+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (40, 'Ramesh', 10000.0, 0, 'B-'),
 (50, 'Rahul', 25000.0, 0, 'B+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (60, 'Rajesh', 60000.0, 0, 'O+')]

In [52]:
my_cur.execute("update employee_data set married_status=True,emp_salary=50000 where emp_id=50")

In [53]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (20, 'Ajay', 70000.0, 0, 'B+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (40, 'Ramesh', 10000.0, 0, 'B-'),
 (50, 'Rahul', 50000.0, 1, 'B+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (60, 'Rajesh', 60000.0, 0, 'O+')]

#### Delete Data from the Table

In [54]:
my_cur.execute("delete from employee_data where emp_id=20")

In [55]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (40, 'Ramesh', 10000.0, 0, 'B-'),
 (50, 'Rahul', 50000.0, 1, 'B+'),
 (60, 'Suresh', 50000.0, 1, 'A+'),
 (60, 'Rajesh', 60000.0, 0, 'O+')]

In [56]:
my_cur.execute("delete from employee_data where emp_id=60 and emp_name='Rajesh'")

In [57]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0, 'O+'),
 (30, 'Ramu', 30000.0, 1, 'A+'),
 (40, 'Ramesh', 10000.0, 0, 'B-'),
 (50, 'Rahul', 50000.0, 1, 'B+'),
 (60, 'Suresh', 50000.0, 1, 'A+')]

#### Drop Column from the table

In [58]:
my_cur.execute("alter table employee_data drop column emp_blood_group")

In [59]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0),
 (30, 'Ramu', 30000.0, 1),
 (40, 'Ramesh', 10000.0, 0),
 (50, 'Rahul', 50000.0, 1),
 (60, 'Suresh', 50000.0, 1)]

#### Add column to the table

In [60]:
my_cur.execute("alter table employee_data add mobile int")

In [61]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0, None),
 (30, 'Ramu', 30000.0, 1, None),
 (40, 'Ramesh', 10000.0, 0, None),
 (50, 'Rahul', 50000.0, 1, None),
 (60, 'Suresh', 50000.0, 1, None)]

In [62]:
my_cur.execute("alter table employee_data drop column mobile")

In [63]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0),
 (30, 'Ramu', 30000.0, 1),
 (40, 'Ramesh', 10000.0, 0),
 (50, 'Rahul', 50000.0, 1),
 (60, 'Suresh', 50000.0, 1)]

In [64]:
my_cur.execute("alter table employee_data add mobile int not null")

In [65]:
show_data("employee_data", my_cur)

[(1, 'Abhishek', 60000.5, 0, 0),
 (30, 'Ramu', 30000.0, 1, 0),
 (40, 'Ramesh', 10000.0, 0, 0),
 (50, 'Rahul', 50000.0, 1, 0),
 (60, 'Suresh', 50000.0, 1, 0)]

### Drop Table

In [66]:
my_cur.execute("show tables")

In [67]:
my_cur.fetchall()

[('employee_data',), ('employee_data_2',)]

In [68]:
my_cur.execute("drop table employee_data_2")

In [69]:
my_cur.execute("show tables")
my_cur.fetchall()

[('employee_data',)]

#### Drop Database

In [70]:
my_cur.execute("drop database mydb")

In [71]:
my_cur.execute("show databases")
my_cur.fetchall()

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [ ]:
#CRUD -- Create Read Update Delete